National_bank_xml/PRISTIGAO_MT102.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns4:getMt102Request xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>M1csZ0YrfXmH49GLUx5IvGEY0n+R0+LRLfs8mguX6rOIJRHhv+SC5JnsND4KJZ5E3HVJbPMU7uTe&#13;
gf763z8AS5m7iDi+Uy09r0Lh3FRMwwmuOQhx5aFaULrzXbua80vi0FFU30XWYk9QNzi9fWNAvIV8&#13;
5e/uVb33V7SJForasuLbidM5YmpJsoipiVLVL8tOz5Bl73Se3GKMo13N8TYeaGQZeHBlRa6RUe3D&#13;
Z0nsbrxMlwrahntZgLbZMJ+uMeSYBflfmyJqLCJyvgUXmUe/a7kDFsw43/35drzPI/vWPPx0TUWY&#13;
MixM5rHvuiTQqTq6g8ztMgpDa1xoJcPh6UstNg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>OuVm9v65azvhf8vlEJcDx/mNgqI6EisoGFByZJsYmwfKrTuDY7Ul91USZcZPNVwtUO24kjNROuEl&#13;
TJgTWTluDTZ37b2/zoK2FqmfKMAIoEggG2+pUXkXGF+1caQ3xminu7Y6ZywAJ3TcsfYNqK0XuW+E&#13;
AXYwLlKJPpVcac66Q92gztloT5C9iVZcve6hzrDovmFJPg5RLwu7X6C5TCJPSC2a1PevR9StmASQ&#13;
eGL0TLe6o8UN01Z9ogyJrH+ORYKE8XjXdg5t/xxeWL1zzltR0cT6OW+u0lFTDJeFBQw4PbstTRkN&#13;
NRjNobcymZaKdyOiXsFADsoCVUxGQFPVo9sa1QjFaINsGwMf3SdUWmE22DAjaBB3crZkWwgUCajC&#13;
tOSmZutQW8oaxTXElIND6QdmuNgPWPaGno/k8BbvilOZ1b+cw3OA9I2Ttc3V/VeAfCCHROXmU7ka&#13;
z2yC/xvEkZkesv3RHEkRy3opEbMkbrrfjo2eNE0NXllN632AcbMR68V+1GyTL/iq77Kmeh+a85fZ&#13;
6Hy+nXg8Hoj70vl1gTR/axy5CfRrni8cddEWWc6TVJuw7+M1Pm58nLgfxdNeg+xFmGAnHz3/CRGG&#13;
6226Vdtg1TK0VK7YvINoJQPvP6eTTDsTr3cHgj6Mu+XgbaKAQJyUtk+fdkrHdqCU7aPLvA74D767&#13;
2MccmBfupW168DTtHBXqAsNhI+zy4M9FFamt+NO2Ef0IixYoN0ADURdFfiRVXcenHc+oSNfpxmx5&#13;
mk376K9/s/IuzN/KedaR3Qk3pRlQ7jp0rCZCKRHWpBcAJ2B1HO2GDQE/TcTsWbhbav0fG64clc9W&#13;
hH05+Ro+nEmvXvB5B4jp7snagQVjvybL5wG0qv9DNNYZXfQaXN9/4RTL8AkqYZRowjKNm7kVKgdH&#13;
zUBr9fdZhD3DlcQII/oMuEfa7SzfeRqGn4j0LBTBwT1oZ+pmItJe8tyVu4AFbfs+HICGa1w7NoYO&#13;
CIPAT/XIP5i6MJ9BRve+SIfbBCLXSI4nQzhJ/UWo3+VAuOn6t6FkpQTS5JsyLcb9676ixb8e/OZW&#13;
9oUSEqgTQCcZ6Fn1wNvntNNhzBVrwh1ylfc1BPhbTSy1IyKYctm+m0iiWV8yOpE9Frk7tOojEGjs&#13;
fvSZZjDp3dOIop3WmC2TNYC8yd5Qvrlu9Y+w4bQuzYqoZLJQLyux8pUqps5aPTm0q+aKrBK0jmiK&#13;
v622m7p+K+okmpZSJV7OlCDYJWfTqt3S2wyh4i0OHhv2GNaTIRVneFQcwbe01eSfw32CujvKOh+y&#13;
8C5hoAj4ftiM0QhOnfTIz30whbpnGwnhPcTwqQJyB4T1NzmP19QDl+j7wZMe2AxrWPSb7Qkz7dfP&#13;
kXKsStPqMmHNU8wZdJBz4Tva5HfoyMC9iHMMph4p2TgZRVT/X4B5vkXUcYcFH6HbWpv/s2fphr80&#13;
kmd25PorBodGpTLsza7rdSy1vsDM0w48aisK9cp+5sLU4GSAMqGRuAQRvp5TwgP1aInlD5/7gFID&#13;
4W8yAX3Cy3mJpZz+S/pqNvUoTx+ZjB5BBsWlSAyn4o34kudM5gYaMUQ4SoVSnLQwo+BiloY/gsAN&#13;
JzFfjC+sK4gYzNKUE5XpsIlpmjJ7KosJi7kpTxtFsuMzA2xnG5d1LOTgy2qAEbAo/dTQ</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns4:getMt102Request></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>Gcxd02UzhkWcwbzD6YK83wD9fZ4=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
XRVQRBeQlk0W8IV+N5fqHcX0wkbHF7zsvvcc6ArWFgkIZ5yYuH1tORvBjeaO2vmFApekOwnjBcOW&#13;
bCp6qQ2Y5gMVnm1wpCKLByU8b8wI6LLQ9VXHDB28tii7SxpPeBhqTDW6ATt7GAdVO+las70OSeYp&#13;
5wdndXQ360Yzj8wz2xaZS6b5ZQsNQ8vTNBgddMy5+m9SaRYr/vVourUVZzA5Afr3AUQq/ApkTeNs&#13;
2khTIqyGWCJPTRA/GXK2lr6Wz++sF6Rf8t8VkaCp4NmkKrexRr2gnvlKrPD4cZO48nSlU6TPnr6w&#13;
1kbgqtGUOEUKpXq0cgVBi/GOpwSscQiv5ysNzw==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>